Revit 2024 API
DeleteElements.Create Method
Overload List
Name | Description
Create(Document, ElementId)
 Creates an instance of the DeleteElements resolution.
Create(Document, IList<ElementId>)
 Creates an instance of the DeleteElements resolution.
Create(Document, ISet<ElementId>)
 Creates an instance of the DeleteElements resolution.
See Also
DeleteElements Class
DeleteElements Members
Autodesk.Revit.DB Namespace